#!/usr/bin/env python
# coding: utf-8

# In[284]:


import pandas as pd


# In[278]:


data_menu = {
    "1": {
        "1": ["ผัดกะเพราหมูสับ", 50], "2": ["ผัดกะเพราหมูเด้ง", 55], "3": ["ผัดกะเพราไข่เยี่ยวม้าหมูสับ", 65], "4": ["ผัดกะเพราเครื่องในไก่", 55], "5": ["ผัดกะเพรากุนเชียง", 60]
    }, 
    "2": {
        "6": ["ผัดพริกแกงหมู", 50], "7": ["ผัดพริกแกงเนื้อ", 65], "8": ["ผัดพริกแกงปลาดุกกรอบ", 80], "9": ["ผัดพริกแกงทะเล", 70], "10": ["ผัดพริกแกงปลาหมึก", 60]
    }, 
    "3": {
        "11": ["ผัดคะน้าหมูกรอบ", 55], "12": ["ผัดคะน้าปลาเค็ม", 55], "13": ["ผัดแขนงหมูกรอบ", 55], "14": ["ผัดผักบุ้งไฟแดง", 50], "15": ["ผัดยอดฟักแม้ว", 50]
    }, 
    "4": {
        "16": ["ผัดผงกะหรี่ปลาหมึก", 65], "17": ["ผัดผงกะหรี่กุ้ง", 65], "18": ["ผัดผงกะหรี่ไก่", 50], "19": ["ผัดผงกะหรี่หมู", 50]
    },
    "5": {
        "20": ["หมูสับคั่วพริกกระเทียม", 50], "21": ["หมูทอดกระเทียมพริกไทย", 50], "22": ["กุ้งกระเทียมพริกไทย", 80], "23": ["ไก่กระเทียม", 50]
    },
    "6": {
        "24": ["ยำหมูยอ", 50], "25": ["ยำปลากระป๋อง", 50], "26": ["ยำวุ้นเส้นโบราณ", 65], "27": ["ยำวุ้นเส้นทะเล", 65], "28": ["ยำไข่แดงเค็ม", 50]
    },
    "7": {
        "29": ["ข้าวต้มกุ้ง", 40], "30": ["ข้าวต้มหมูสับ", 40], "31": ["ข้าวต้มปลา", 50]
    },
    "8": {
        "32": ["สุกี้น้ำหมู", 50], "33": ["สุกี้น้ำทะเล", 50], "34": ["สุกี้แห้งหมู", 50], "35": ["สุกี้น้ำไก่", 50], "36": ["สุกี้แห้งไก่", 50]
    }
}


# In[275]:


my_shop = "ตั้งหวังเจ๊งโภชนา"
print(f"สวัสดีครับ ยินดีต้อนรับสู่ {my_shop}")

customer_name = input("กรุณาแจ้งชื่อของคุณลูกค้าครับ:")
print(f"สวัสดีครับ คุณ {customer_name} สั่งอาหารอะไรดีครับ?")
print("นี่คือเมนูอาหารของเราครับ")

def cate_fn():
    print("[1] เมนูผัดกะเพรา\n[2] เมนูผัดพริกแกง\n[3] เมนูผัดผัก\n[4] เมนูผัดผงกะหรี่\n[5] เมนูผัดกระเทียม\n[6] เมนูยำ\n[7] เมนูข้าวต้ม\n[8] เมนูสุกี้")
    xxx = input("กรุณาเลือกหมวดหมู่อาหาร:")
    return xxx

def list_menu():
    # Loop ผ่านแต่ละ category ใน dict
    for category, menu_items in data_menu.items():
        for key, food_item in menu_items.items():
            if key in add_menu: # ตรวจสอบว่า key อยู่ใน list ที่ต้องการหรือไม่
                print(f" - {key}. {food_item}")  # แสดง key และชื่ออาหาร

cate_menu = cate_fn()

add_menu = []
while True:
    # Loop ผ่านแต่ละ item ใน category
    select_cate = data_menu[cate_menu]
    for key, food_item in select_cate.items():
        print(f"{key}. {food_item}")  # แสดง key และชื่ออาหาร
    print("0. กลับหน้าหมวดหมู่\n99. พอแล้วจ้า สรุปยอดและชำระเงิน")
    
    menu = input("กรุณาเลือกเมนูอาหาร")
    if menu == '0':
        cate_menu = cate_fn()
    elif menu == '99':
        print("สรุปยอดและชำระเงิน")
        calc = True
        break
    else:
        add_menu.append(menu)
        print("รายการอาหารที่สั่ง:")
        list_menu()
        print("_"*50)

if calc == True:
    total_calc = 0
    print("_"*50)
    print(f"คุณ {customer_name} สั่งรายการอาหารดังนี้:")
    
    # Loop ผ่านแต่ละ category ใน dict
    for category, menu_items in data_menu.items():
        for key, food_item in menu_items.items():
            if key in add_menu: # ตรวจสอบว่า key อยู่ใน list ที่ต้องการหรือไม่
                total_calc += food_item[1]
                print(f" - {key}. {food_item}")  # แสดง key และชื่ออาหาร
    
    print(f"ยอดรวมทั้งหมดคือ {total_calc} บาทครับ ")
    
    while True:
        print(f"คุณ {customer_name} ยืนยันการชำระเงินเลยใช่มั้ยครับ?")
        confirm = input("[1] ใช่ จ่ายเงินเลย\n[2] สักครู่หยิบเงินแพรบ")
        if confirm == '1':
            print(f"ขอบคุณที่ใช้บริการ {my_shop} ครับ")
            break

